run/reactingShockTube-OF14/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

U_init          (-487.34 0 0);
internalField   uniform $U_init;

boundaryField
{
    leftWall
    {
        // type            noSlip;
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    inlet
    {
        // type            inletOutlet;
        // inletValue      uniform (-487.34 0 0);
        // value           uniform (-487.34 0 0);

        type            waveTransmissive;
        gamma           1.4;
        fieldInf        $U_init;
        lInf            1e2;
    }
    
    emptyWalls
    {
        type            empty;
    }
}


// ************************************************************************* //
