run/reactingShockTube-OF14/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

Y_init          0.0;
internalField   uniform $Y_init;

boundaryField
{
    leftWall
    {
        type            zeroGradient;
    }
    
    inlet
    {
        // type            zeroGradient;

        type            waveTransmissive;
        gamma           1.4;
        fieldInf        $Y_init;
        lInf            1e2;
    }
    
    emptyWalls
    {
        type            empty;
    }
}


// ************************************************************************* //
