run/reactingShockTube-OF14/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;

    // reconstruct(rho) vanAlbada;
    // reconstruct(U)  vanAlbadaV;
    // reconstruct(T)  vanAlbada;
    // reconstruct(Yi)   vanAlbada;

    // reconstruct(rho) vanLeer;
    // reconstruct(U)   vanLeerV; //linearUpwindV grad(U); //upwind; //vanLeerV;
    // reconstruct(T)   vanLeer;
    // reconstruct(Yi)   vanLeer;

    reconstruct(rho)      Minmod;
    reconstruct(U)        MinmodV;
    reconstruct(T)        Minmod;
    reconstruct(Yi)       Minmod;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
