run/reactingShockTube-OF14/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

libs ("libsampling.so");

setFormat             raw;      // alternatives: gnuplot, csv, vtk

/* Minimal settings for OpenFOAM v13 `foamPostProcess -func sample` */
interpolationScheme   cellPointFace;

fields (T U H);

sets
(
    x
    {
        type        lineFace;
        axis        x;
        // start       (-1 1e-5 1e-5);
        // end         (1 1e-5 1e-5);
        start       (0 0 0);
        end         (0.12 0 0);
        // nPoints     1000;
    }
);

// ************************************************************************* //
