run/reactingShockTube-OF14/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    U (0 0 0);
    T 378.656;
    p 7173;
};

zones
{
    rightState
    {
        type        box;
        zoneType    cell;

        box (0.06 -1e4 -1e4) (0.12 1e4 1e4);
        
        values
        {
            U (-487.34 0 0);
            T 748.472;
            p 35594;
        };
    }
};


// ************************************************************************* //
